Revit 2024 API
RebarCoupler.GetCouplerQuantity Method
 Identifies the number of couplers in a set.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2017
Syntax
C#
public int GetCouplerQuantity()
Visual Basic
Public Function GetCouplerQuantity As Integer
Visual C++
public:
int GetCouplerQuantity()
Return Value
 Returns the number of couplers in a set.
See Also
RebarCoupler Class
Autodesk.Revit.DB.Structure Namespace